# IsFrameValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..IsFrameValid Method
SunAndShadowSettings Class See Also
---
Checks whether the frame is valid for the supplied SunAndShadowSettings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsFrameValid(
	double frame
)
```

Visual Basic
---
```text
Public Function IsFrameValid ( _
	frame As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsFrameValid(
	double frame
)
```

# ### Parameters
frame
    Type: System..::..Double Frame value
# ### Return Value
True if the frame is valid for the SunAndShadowSettings, false otherwise.
# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace